package kana_conversion

// regex patterns for substitutions
const XU__PATTERN string = "ッ(.)"                          // 小さい "ッ" は直後の文字を２回に変換
const LTU_PATTERN string = "ッ$"                            // 最後の小さい "ッ" は消去(?)
const ER__PATTERN string = "(.)ー"                          // "ー"は直前の文字を２回に変換
const N___PATTERN string = "n(b|p)([aiueo])"                // n の後ろが バ行、パ行 なら m に修正
const OO__PATTERN string = "([aiueo])$1"                   // oosaka → osaka
const MBA_PATTERN string = "m(b|p)([aiueo])"                // m の後ろにバ行、パ行のときは "ン" と変換
const XTU_PATTERN string = "([bcdfghjklmpqrstvwxyz])$1"    // 子音が続く時は "ッ" と変換
const A___PATTERN string = "([aiueo])$1"                   // 母音が続く時は "ー" と変換
const MBA_SUB_PATTERN string = "ン\\1\\2"
const XU__SUB_PATTERN string = "ッ\\1"
const A___SUB_PATTERN string = "\\1ー"
const XTU_SUB_PATTERN string = "\\1\\1"
const LTU_SUB_PATTERN string = ""
const ER__SUB_PATTERN string = "\\1\\1"
const N___SUB_PATTERN string = "m\\1\\2"
const OO__SUB_PATTERN string = "\\1"
const JOIN_CHAR string = "|"

var katakana = map[string]string {
    "ア":"あ", "イ":"い", "ウ":"う", "エ":"え", "オ":"お",
    "カ":"か", "キ":"き", "ク":"く", "ケ":"け", "コ":"こ",
    "サ":"さ", "シ":"し", "ス":"す", "セ":"せ", "ソ":"そ",
    "タ":"た", "チ":"ち", "ツ":"つ", "テ":"て", "ト":"と",
    "ナ":"な", "ニ":"に", "ヌ":"ぬ", "ネ":"ね", "ノ":"の",
    "ハ":"は", "ヒ":"ひ", "フ":"ふ", "ヘ":"へ", "ホ":"ほ",
    "マ":"ま", "ミ":"み", "ム":"む", "メ":"め", "モ":"も",
    "ヤ":"や", "ユ":"ゆ", "ヨ":"よ", "ラ":"ら", "リ":"り",
    "ル":"る", "レ":"れ", "ロ":"ろ", "ワ":"わ", "ヲ":"を",
    "ン":"ん",

    "ガ":"が", "ギ":"ぎ", "グ":"ぐ", "ゲ":"げ", "ゴ":"ご",
    "ザ":"ざ", "ジ":"じ", "ズ":"ず", "ゼ":"ぜ", "ゾ":"ぞ",
    "ダ":"だ", "ヂ":"ぢ", "ヅ":"づ", "デ":"で", "ド":"ど",
    "バ":"ば", "ビ":"び", "ブ":"ぶ", "ベ":"べ", "ボ":"ぼ",
    "パ":"ぱ", "ピ":"ぴ", "プ":"ぷ", "ペ":"ぺ", "ポ":"ぽ",

    "ァ":"ぁ", "ィ":"ぃ", "ゥ":"ぅ", "ェ":"ぇ", "ォ":"ぉ",
    "ャ":"ゃ", "ュ":"ゅ", "ョ":"ょ",
    "ヴ":"ゔ", "ッ":"っ", "ヰ":"ゐ", "ヱ":"ゑ",
}

// Swap keys / values from kata to create hira dictionary
var hiragana = map[string] string {}
//hiragana = dict([(v, k) for k, v in katakana.items()])

var kana_asist = map[string]string { "a":"ァ", "i":"ィ", "u":"ゥ", "e":"ェ", "o":"ォ", }

var romaji = map[string]string {
    "a"  :"ア", "i"  :"イ", "u"  :"ウ", "e"  :"エ", "o"  :"オ",
    "ka" :"カ", "ki" :"キ", "ku" :"ク", "ke" :"ケ", "ko" :"コ",
    "sa" :"サ", "shi":"シ", "su" :"ス", "se" :"セ", "so" :"ソ",
    "ta" :"タ", "chi":"チ", "tu" :"ツ", "te" :"テ", "to" :"ト",
    "na" :"ナ", "ni" :"ニ", "nu" :"ヌ", "ne" :"ネ", "no" :"ノ",
    "ha" :"ハ", "hi" :"ヒ", "fu" :"フ", "he" :"ヘ", "ho" :"ホ",
    "ma" :"マ", "mi" :"ミ", "mu" :"ム", "me" :"メ", "mo" :"モ",
    "ya" :"ヤ", "yu" :"ユ", "yo" :"ヨ",
    "ra" :"ラ", "ri" :"リ", "ru" :"ル", "re" :"レ", "ro" :"ロ",
    "wa" :"ワ", "wo" :"ヲ", "n"  :"ン", "vu" :"ヴ",
    "ga" :"ガ", "gi" :"ギ", "gu" :"グ", "ge" :"ゲ", "go" :"ゴ",
    "za" :"ザ", "ji" :"ジ", "zu" :"ズ", "ze" :"ゼ", "zo" :"ゾ",
    "da" :"ダ", "di" :"ヂ", "du" :"ヅ", "de" :"デ", "do" :"ド",
    "ba" :"バ", "bi" :"ビ", "bu" :"ブ", "be" :"ベ", "bo" :"ボ",
    "pa" :"パ", "pi" :"ピ", "pu" :"プ", "pe" :"ペ", "po" :"ポ",

    "kya":"キャ", "kyi":"キィ", "kyu":"キュ", "kye":"キェ", "kyo":"キョ",
    "gya":"ギャ", "gyi":"ギィ", "gyu":"ギュ", "gye":"ギェ", "gyo":"ギョ",
    "sha":"シャ",               "shu":"シュ", "she":"シェ", "sho":"ショ",
    "ja" :"ジャ",               "ju" :"ジュ", "je" :"ジェ", "jo" :"ジョ",
    "cha":"チャ",               "chu":"チュ", "che":"チェ", "cho":"チョ",
    "dya":"ヂャ", "dyi":"ヂィ", "dyu":"ヂュ", "dhe":"デェ", "dyo":"ヂョ",
    "nya":"ニャ", "nyi":"ニィ", "nyu":"ニュ", "nye":"ニェ", "nyo":"ニョ",
    "hya":"ヒャ", "hyi":"ヒィ", "hyu":"ヒュ", "hye":"ヒェ", "hyo":"ヒョ",
    "bya":"ビャ", "byi":"ビィ", "byu":"ビュ", "bye":"ビェ", "byo":"ビョ",
    "pya":"ピャ", "pyi":"ピィ", "pyu":"ピュ", "pye":"ピェ", "pyo":"ピョ",
    "mya":"ミャ", "myi":"ミィ", "myu":"ミュ", "mye":"ミェ", "myo":"ミョ",
    "rya":"リャ", "ryi":"リィ", "ryu":"リュ", "rye":"リェ", "ryo":"リョ",
    "fa" :"ファ", "fi" :"フィ",               "fe" :"フェ", "fo" :"フォ",
    "wi" :"ウィ", "we" :"ウェ",
    "va" :"ヴァ", "vi" :"ヴィ", "ve" :"ヴェ", "vo" :"ヴォ",

    "kwa":"クァ", "kwi":"クィ", "kwu":"クゥ", "kwe":"クェ", "kwo":"クォ",
    "kha":"クァ", "khi":"クィ", "khu":"クゥ", "khe":"クェ", "kho":"クォ",
    "gwa":"グァ", "gwi":"グィ", "gwu":"グゥ", "gwe":"グェ", "gwo":"グォ",
    "gha":"グァ", "ghi":"グィ", "ghu":"グゥ", "ghe":"グェ", "gho":"グォ",
    "swa":"スァ", "swi":"スィ", "swu":"スゥ", "swe":"スェ", "swo":"スォ",
    "zwa":"ズヮ", "zwi":"ズィ", "zwu":"ズゥ", "zwe":"ズェ", "zwo":"ズォ",
    "twa":"トァ", "twi":"トィ", "twu":"トゥ", "twe":"トェ", "two":"トォ",
    "dwa":"ドァ", "dwi":"ドィ", "dwu":"ドゥ", "dwe":"ドェ", "dwo":"ドォ",
    "mwa":"ムヮ", "mwi":"ムィ", "mwu":"ムゥ", "mwe":"ムェ", "mwo":"ムォ",
    "bwa":"ビヮ", "bwi":"ビィ", "bwu":"ビゥ", "bwe":"ビェ", "bwo":"ビォ",
    "pwa":"プヮ", "pwi":"プィ", "pwu":"プゥ", "pwe":"プェ", "pwo":"プォ",
    "phi":"プィ", "phu":"プゥ", "phe":"プェ", "pho":"フォ",
}

var romaji_asist = map[string]string {
    "si" :"シ"  , "ti" :"チ"  , "hu" :"フ" , "zi":"ジ",
    "sya":"シャ", "syu":"シュ", "syo":"ショ",
    "tya":"チャ", "tyu":"チュ", "tyo":"チョ",
    "cya":"チャ", "cyu":"チュ", "cyo":"チョ",
    "jya":"ジャ", "jyu":"ジュ", "jyo":"ジョ", "pha":"ファ",
    "qa" :"クァ", "qi" :"クィ", "qu" :"クゥ", "qe" :"クェ", "qo":"クォ",

    "ca" :"カ", "ci":"シ", "cu":"ク", "ce":"セ", "co":"コ",
    "la" :"ラ", "li":"リ", "lu":"ル", "le":"レ", "lo":"ロ",

    "mb" :"ム", "py":"パイ", "tho": "ソ", "thy":"ティ", "oh":"オウ",
    "by":"ビィ", "cy":"シィ", "dy":"ディ", "fy":"フィ", "gy":"ジィ",
    "hy":"シー", "ly":"リィ", "ny":"ニィ", "my":"ミィ", "ry":"リィ",
    "ty":"ティ", "vy":"ヴィ", "zy":"ジィ",

    "b":"ブ", "c":"ク", "d":"ド", "f":"フ"  , "g":"グ", "h":"フ", "j":"ジ",
    "k":"ク", "l":"ル", "m":"ム", "p":"プ"  , "q":"ク", "r":"ル", "s":"ス",
    "t":"ト", "v":"ヴ", "w":"ゥ", "x":"クス", "y":"ィ", "z":"ズ",
}

var zenkaku = map[string]string {
    "a": "ａ", "b": "ｂ", "c": "ｃ", "d": "ｄ", "e": "ｅ",
    "f": "ｆ", "g": "ｇ", "h": "ｈ", "i": "ｉ", "j": "ｊ",
    "k": "ｋ", "l": "ｌ", "m": "ｍ", "n": "ｎ", "o": "ｏ",
    "p": "ｐ", "q": "ｑ", "r": "ｒ", "s": "ｓ", "t": "ｔ",
    "u": "ｕ", "v": "ｖ", "w": "ｗ", "x": "ｘ", "y": "ｙ",
    "z": "ｚ",
    "A": "Ａ", "B": "Ｂ", "C": "Ｃ", "D": "Ｄ", "E": "Ｅ",
    "F": "Ｆ", "G": "Ｇ", "H": "Ｈ", "I": "Ｉ", "J": "Ｊ",
    "K": "Ｋ", "L": "Ｌ", "M": "Ｍ", "N": "Ｎ", "O": "Ｏ",
    "P": "Ｐ", "Q": "Ｑ", "R": "Ｒ", "S": "Ｓ", "T": "Ｔ",
    "U": "Ｕ", "V": "Ｖ", "W": "Ｗ", "X": "Ｘ", "Y": "Ｙ",
    "Z": "Ｚ",
    "0": "０", "1": "１", "2": "２", "3": "３", "4": "４",
    "5": "５", "6": "６", "7": "７", "8": "８", "9": "９",
    "-": "ー", "_": "＿", ".": "。", "(": "「", ")": "」",
}

var zenkaku_assist = map[string]string {}
